# 11_dataframes
### Creating DataFrames different ways.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame([['Colorado Springs', 'Phoenix', 'Raleigh', 'Milwaukee', 'Seattle'],
              [6172, 1132, 437, 723, 429]] )
df1

                  0        1        2          3        4
0  Colorado Springs  Phoenix  Raleigh  Milwaukee  Seattle
1              6172     1132      437        723      429

In [3]:
df1.index = ['City', 'Elevation']

In [4]:
df1

                          0        1        2          3        4
City       Colorado Springs  Phoenix  Raleigh  Milwaukee  Seattle
Elevation              6172     1132      437        723      429

<br><br>
Initializing using a dictionary...

In [5]:
data = {
    'elevation': [6172, 1132, 437, 723, 429],
    'median_age': [34.5, 32.8, 32.8, 31.1, 36.1],
    'median_income': [53550, 46601, 55170, 35186, 70172],
}

In [6]:
df2 = pd.DataFrame(data, index=['Colorado Springs', 'Phoenix', 'Raleigh', 'Milwaukee', 'Seattle'])

In [7]:
df2

                  elevation  median_age  median_income
Colorado Springs       6172        34.5          53550
Phoenix                1132        32.8          46601
Raleigh                 437        32.8          55170
Milwaukee               723        31.1          35186
Seattle                 429        36.1          70172

<br><br>
Using lists, setting index and columns after...

In [8]:
data = [
    [6172, 1132, 437, 723, 429],
    [34.5, 32.8, 32.8, 31.1, 36.1],
    [53550, 46601, 55170, 35186, 70172]
]

In [9]:
columns = ['elevation', 'median_age', 'median_income']
index = ['Colorado Springs', 'Phoenix', 'Raleigh', 'Milwaukee', 'Seattle']

In [10]:
arr = np.array(data, dtype=int)
df3 = pd.DataFrame(arr.transpose(), index=index, columns=columns)

In [11]:
df3

                  elevation  median_age  median_income
Colorado Springs       6172          34          53550
Phoenix                1132          32          46601
Raleigh                 437          32          55170
Milwaukee               723          31          35186
Seattle                 429          36          70172